snlkuharlocal/src/Documents/ЗадачиАСУ/ЗадачиАСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачиАСУ</name>
  <basedOn>Document.ЗадачиАСУ</basedOn>
  <basedOn>Document.Совещание</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадачи</name>
    <type>
      <types>CatalogRef.СостояниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзмененияТЗ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботыПоПоследнемуИзменению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияПоТекущемуТЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаВремени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗадачи</name>
    <type>
      <types>EnumRef.КатегорииЗадачАсу</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Совещание</name>
    <type>
      <types>DocumentRef.Совещание</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеальныйИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастоящийИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаИзСогласованногоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесПроцессАСУ</name>
    <type>
      <types>CatalogRef.БизнесПроцессАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетАСУ</name>
    <type>
      <types>EnumRef.ПриоритетАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачиАСУ</name>
    <type>
      <types>CatalogRef.ВидЗадачиАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиЗадачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемаяПродолжительностьВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяДатаПланируемогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяДатаПланируемогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПроекта</name>
    <attributes>
      <name>ОписаниеЭтапа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/СостояниеЗадачи/СостояниеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостояниеЗадачи</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Done</description>
    </items>
    <items>
      <name>НетАктов</name>
      <description>Нет актов</description>
    </items>
    <items>
      <name>Отклонённые</name>
      <description>ОтменённыеЗадачи</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗадачиАСУ/Forms/ФормаПланировщика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	СоздатьИзмеренияПланировщика();	
	ОбновитьПериодОтображенияПланировщика();
	
	ЗаполнитьЖурналЗадач();
	
	
КонецПроцедуры


&НаСервере
Процедура СоздатьИзмеренияПланировщика()
	Планировщик.Измерения.Очистить();
	Измерение = Планировщик.Измерения.Добавить("Сотрудник");
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Родитель = &Родитель";
	запрос.УстановитьПараметр("Родитель",Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00760"));
	выборка=запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		если ЗначениеЗаполнено(Сотрудник) и выборка.ссылка<>Сотрудник тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеИзмерения = Измерение.Элементы.Добавить(Выборка.Ссылка);	
		ЗначениеИзмерения.Текст = Выборка.Наименование;
		ЗначениеИзмерения.ЦветРамки = WebЦвета.Синий;
		
	КонецЦикла;
	
КонецПроцедуры 



&НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()
	
	Начало = НачалоМесяца(Дата);
	Конец = КонецМесяца(Дата);
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало, Конец);
	
КонецПроцедуры // ОбновитьПериодОтображенияПланировщика()



&НаСервере
Процедура ЗаполнитьЖурналЗадач()
	
	
	Планировщик.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ЗадачиАСУ.Ссылка КАК Задача,
	|	ЗадачиАСУ.ДатаПланируемогоНачала КАК ДатаНачала,
	|	ЗадачиАСУ.НастоящийИсполнитель КАК НастоящийИсполнитель,
	|	ЗадачиАСУ.НаименованиеЗадачи КАК НаименованиеЗадачи,
	|	ЗадачиАСУ.ДатаПланируемогоОкончания КАК ДатаОкончания,
	|	ЗадачиАСУ.СостояниеЗадачи КАК СостояниеЗадачи,
	|	ЗадачиАСУ.Распределена КАК Распределена
	|ИЗ
	|	Документ.ЗадачиАСУ КАК ЗадачиАСУ
	|ГДЕ
	|	ЗадачиАСУ.Проведен
	|	И ЗадачиАСУ.ДатаПланируемогоНачала МЕЖДУ &Дата1 И &Дата2
	|	И &СоставнойФильтр
	|	И ЗадачиАСУ.НастоящийИсполнитель В ИЕРАРХИИ(&НастоящийИсполнитель)";  
	запрос.УстановитьПараметр("НастоящийИсполнитель",Справочники.ФизическиеЛица.НайтиПоКоду("SNL-00760"));
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Дата));
	// Кухарь А.Ю.  27.04.2023 начало
	//
	СоставнойФильтр = "";
	если СкрытьЗавершённые тогда
		СоставнойФильтр=СоставнойФильтр+" "+" не СостояниеЗадачи в (&СписокЗавершенныхСостояний) ";
		СписокЗавершенныхСостояний=новый СписокЗначений;
		СписокЗавершенныхСостояний.Добавить(Справочники.СостояниеЗадачи.Выполнена);
		СписокЗавершенныхСостояний.Добавить(Справочники.СостояниеЗадачи.Отклонённые);
		запрос.УстановитьПараметр("СписокЗавершенныхСостояний",СписокЗавершенныхСостояний);
		
	КонецЕсли;
	
	если СоставнойФильтр<>"" тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"&СоставнойФильтр",СоставнойФильтр);
	иначе
		запрос.УстановитьПараметр("СоставнойФильтр",Истина);
	КонецЕсли;
	// Кухарь А.Ю.  27.04.2023 конец
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		если ЗначениеЗаполнено(Сотрудник) и выборка.НастоящийИсполнитель<>Сотрудник тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияИзмерений = Новый Соответствие;
		ЗначенияИзмерений.Вставить("Сотрудник", Выборка.НастоящийИсполнитель);
		
		ЖирныйШрифт = Новый Шрифт(,,Истина);		                                                                       
		//	
		ПредставлениеЗадачи = символы.ПС+Выборка.НаименованиеЗадачи+Символы.ПС+Строка(Выборка.СостояниеЗадачи);
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ПредставлениеЗадачи, ЖирныйШрифт));
		//	
		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоДня(Выборка.ДатаНачала), Выборка.ДатаОкончания);
		ЭлементПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначенияИзмерений);	
		ЭлементПланировщика.Значение = Выборка.Задача;
		ЭлементПланировщика.Текст = Новый ФорматированнаяСтрока(МассивСтрок);
		
		
		// Кухарь А.Ю.  27.04.2023 начало
		//
		
		Цвет = новый цвет (Выборка.СостояниеЗадачи.Цвет1,Выборка.СостояниеЗадачи.Цвет2,Выборка.СостояниеЗадачи.Цвет3);  
		Если Выборка.СостояниеЗадачи.цвет1=0 и Выборка.СостояниеЗадачи.цвет2=0 и Выборка.СостояниеЗадачи.цвет3=0 тогда 
			Цвет = Неопределено;
		КонецЕсли;
		
		// Кухарь А.Ю. 11.05.2022 начало
		Если Выборка.Распределена тогда
			Цвет = WebЦвета.ГолубойСоСтальнымОттенком;
		КонецЕсли;
		
		если цвет <>Неопределено тогда
			ЭлементПланировщика.ЦветФона = Цвет;
		КонецЕсли;
		// Кухарь А.Ю. 11.05.2022 конец
		
		// Кухарь А.Ю.  27.04.2023 конец
		
		
		//	Цвет = Выборка.Цвет.Получить();
		//	Если Цвет = Неопределено Тогда
		//		Цвет = WebЦвета.БледноЛиловый;
		//	КонецЕсли;
		//	
		//	ЭлементПланировщика.ЦветФона = Цвет;
		//	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЖурналЗаписей()



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СоздатьИзмеренияПланировщика();	
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗадач();
	
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;        
	//ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы; 
	//
	//ЗначенияЗаполнения = Новый Структура;
	////ЗначенияЗаполнения.Вставить("Переговорная", ЭлементПланировщика.Переговорная);
	//ЗначенияЗаполнения.Вставить("ДатаНачала", Начало);
	//ЗначенияЗаполнения.Вставить("Время", 1);
	//ЗначенияЗаполнения.Вставить("Переговорная", ЗначенияИзмерений["Переговорная"]);
	//
	//СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	//
	//ОткрытьФорму("Документ.ЗаписьВПереговорную.ФормаОбъекта", СтруктураПараметров);
	//
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;  
	если ВыделенныеЭлементы.количество() = 0 тогда Возврат;КонецЕсли;
	ЭлементПланировщика = ВыделенныеЭлементы[0];
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("ДатаПланируемогоНачала", ЭлементПланировщика.Начало);
	//ЗначенияРеквизитов.Вставить("ДатаОкончания", ЭлементПланировщика.Конец);
	
	//Время=(ЭлементПланировщика.Конец-ЭлементПланировщика.Начало)/3600;
	//ЗначенияРеквизитов.Вставить("Время", Время);
	ЗначенияРеквизитов.Вставить("НастоящийИсполнитель", ЭлементПланировщика.ЗначенияИзмерений["Сотрудник"]);
	Ошибки="";
	ОбновитьДанныеЗаписи(ЭлементПланировщика.Значение, ЗначенияРеквизитов,Ошибки);
	если не ПустаяСтрока(Ошибки) тогда
		Сообщить(Ошибки);
	КонецЕсли;
	ЗаполнитьЖурналЗадач();
	
КонецПроцедуры 



&НаСервереБезКонтекста
Процедура ОбновитьДанныеЗаписи(Запись, ЗначенияРеквизитов,Ошибки="")
	
	ОбъектЗаписи = Запись.ПолучитьОбъект();
	
	ЕстьИзмения = Ложь;
	Для каждого Реквизит Из ЗначенияРеквизитов Цикл
		Если ОбъектЗаписи[Реквизит.Ключ] <> Реквизит.Значение Тогда
			ЕстьИзмения = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;	
	ЗначенияРеквизитов.вставить("ссылка",Запись);
	
	
	Если ЕстьИзмения Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаписи, ЗначенияРеквизитов);
		ОбъектЗаписи.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;   
	
КонецПроцедуры 


&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;  
	
	ЭлементПланировщика = ВыделенныеЭлементы[0];
	
	СтруктураПараметров = Новый Структура("Ключ", ЭлементПланировщика.Значение);
	ОткрытьФорму("Документ.ЗадачиАСУ.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	если ТипЗнч(ТекущиеПериодыОтображения)=Тип("Массив") и ТекущиеПериодыОтображения.количество()>0 тогда
		если ТекущиеПериодыОтображения.получить(0).Начало<>НачалоНедели(Дата) тогда
			//ТекущиеПериодыОтображения.получить(0).Начало = НачалоНедели(Дата);
			//ТекущиеПериодыОтображения.получить(0).Конец = КонецНедели(Дата);
			СтандартнаяОбработка=ложь;
		иначе
			СтандартнаяОбработка=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗавершённыеПриИзменении(Элемент)
	ЗаполнитьЖурналЗадач();
КонецПроцедуры
